namespace AssigmentOOP3
{
    internal class Program
    {
        static void Main(string[] args)
        {
            #region answer part1
            //q1  A=الoverloding يعني انا بعمل فانكشن بنفس الاسم بس  فى نفس الكلاس بس الاختلاف بيكون فى عدد البراميتر اونوعهم او ترتيبهم اوقات  بيبقى نفس السلوك بس ده مش افضل حاجه
//override=اول حاجه لازم لازم يكون فى وراثهم انا بورث فانكشن وبغير فى السلوك بتاعها على حسب الى انا محتاجاه بنكتب فى كلاس الاب virtual واللى هيورث overide
//وهنا مينفعش نغير او نعمل اي حاجه فى البراميتر
//B==static binding =بيحصل ساعه الcompiletime  وبنستخدم مهاه الكيورد new 
//diynimc binding==بيحصل ساعه الruntimeوهو افضل بكتير ريفرنس من الاب يقدر يشاور على الاوبجيكت
// q 2
//q2 a== وقف سلسله التورث اوعمليه الثوريت محدش بعده يقدر يورث منه
// b==seld class بتمنع ان يتم توريثها بالكامل يعني محدش يقدر يجي بعدها يورث منها 
//selad method بتمنع ان حد يقدر ييورثها بعدها ويعمل عليها override
//c= لا لان الكيورد seled تمنع اصلا ان حد يقدر يعمل عليها override;
         #endregion

        }
    }
}
